zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K146/S32K146_device.h
/* The count of SYSMPU_RGDAAC */
#define SYSMPU_RGDAAC_COUNT                      (8U)


/*!
 * @}
 */ /* end of group SYSMPU_Register_Masks */


/* SYSMPU - Peripheral instance base addresses */
/** Peripheral SYSMPU base address */
#define SYSMPU_BASE                              (0x4000D000u)
/** Peripheral SYSMPU base pointer */
#define SYSMPU                                   ((SYSMPU_Type *)SYSMPU_BASE)
/** Array initializer of SYSMPU peripheral base addresses */
#define SYSMPU_BASE_ADDRS                        { SYSMPU_BASE }
/** Array initializer of SYSMPU peripheral base pointers */
#define SYSMPU_BASE_PTRS                         { SYSMPU }

/*!
 * @}
 */ /* end of group SYSMPU_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- MSCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Peripheral_Access_Layer MSCM Peripheral Access Layer
 * @{
 */

/* MSCM - Peripheral instance base addresses */
/** Peripheral MSCM base address */
#define MSCM_BASE                                IP_MSCM_BASE
/** Peripheral MSCM base pointer */
#define MSCM                                     IP_MSCM
/** Array initializer of MSCM peripheral base addresses */
#define MSCM_BASE_ADDRS                          IP_MSCM_BASE_ADDRS
/** Array initializer of MSCM peripheral base pointers */
#define MSCM_BASE_PTRS                           IP_MSCM_BASE_PTRS

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPUART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Peripheral_Access_Layer LPUART Peripheral Access Layer
 * @{
 */

/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART0 base address */
#define LPUART0_BASE                             IP_LPUART0_BASE
/** Peripheral LPUART0 base pointer */
#define LPUART0                                  IP_LPUART0
/** Peripheral LPUART1 base address */
#define LPUART1_BASE                             IP_LPUART1_BASE
/** Peripheral LPUART1 base pointer */
#define LPUART1                                  IP_LPUART1
/** Peripheral LPUART2 base address */
#define LPUART2_BASE                             IP_LPUART2_BASE
/** Peripheral LPUART2 base pointer */
#define LPUART2                                  IP_LPUART2
/** Array initializer of LPUART peripheral base addresses */
#define LPUART_BASE_ADDRS                        IP_LPUART_BASE_ADDRS
/** Array initializer of LPUART peripheral base pointers */
#define LPUART_BASE_PTRS                         IP_LPUART_BASE_PTRS
/** Interrupt vectors for the LPUART peripheral type */
#define LPUART_RX_TX_IRQS                        { LPUART0_RxTx_IRQn, LPUART1_RxTx_IRQn, LPUART2_RxTx_IRQn }
#define LPUART_ERR_IRQS                          { LPUART0_RxTx_IRQn, LPUART1_RxTx_IRQn, LPUART2_RxTx_IRQn }

/*!
 * @}
 */ /* end of group LPUART_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- LPI2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Peripheral_Access_Layer LPI2C Peripheral Access Layer
 * @{
 */

/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C0 base address */
#define LPI2C0_BASE                              IP_LPI2C0_BASE
/** Peripheral LPI2C0 base pointer */
#define LPI2C0                                   IP_LPI2C0
/** Array initializer of LPI2C peripheral base addresses */
#define LPI2C_BASE_ADDRS                         IP_LPI2C_BASE_ADDRS
/** Array initializer of LPI2C peripheral base pointers */
#define LPI2C_BASE_PTRS                          IP_LPI2C_BASE_PTRS
/** Interrupt vectors for the LPI2C peripheral type */
#define LPI2C_IRQS                               { LPI2C0_Master_IRQn }

/*!
 * @}
 */ /* end of group LPI2C_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Peripheral_Access_Layer LPSPI Peripheral Access Layer
 * @{
 */

/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI0 base address */
#define LPSPI0_BASE                              IP_LPSPI0_BASE
/** Peripheral LPSPI0 base pointer */
#define LPSPI0                                   IP_LPSPI0
/** Peripheral LPSPI1 base address */
#define LPSPI1_BASE                              IP_LPSPI1_BASE
/** Peripheral LPSPI1 base pointer */
#define LPSPI1                                   IP_LPSPI1
/** Peripheral LPSPI2 base address */
#define LPSPI2_BASE                              IP_LPSPI2_BASE
/** Peripheral LPSPI2 base pointer */
#define LPSPI2                                   IP_LPSPI2
/** Array initializer of LPSPI peripheral base addresses */
#define LPSPI_BASE_ADDRS                         IP_LPSPI_BASE_ADDRS
/** Array initializer of LPSPI peripheral base pointers */
#define LPSPI_BASE_PTRS                          IP_LPSPI_BASE_PTRS
/** Interrupt vectors for the LPSPI peripheral type */
#define LPSPI_IRQS                               { LPSPI0_IRQn, LPSPI1_IRQn, LPSPI2_IRQn }

/*!
 * @}
 */ /* end of group LPSPI_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LMEM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LMEM_Peripheral_Access_Layer LMEM Peripheral Access Layer
 * @{
 */

/*!
 * @addtogroup LMEM_Register_Masks LMEM Register Masks
 * @{
 */

/*! @name PCCCR - Cache control register */
/*! @{ */

/* ENWRBUF - Enable Write Buffer is not available on this SoC */
#define LMEM_PCCCR_ENWRBUF_MASK                  (0U)
#define LMEM_PCCCR_ENWRBUF_SHIFT                 (0U)
#define LMEM_PCCCR_ENWRBUF(x)                    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_ENWRBUF_SHIFT)) & LMEM_PCCCR_ENWRBUF_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group LMEM_Register_Masks */

/* LMEM - Peripheral instance base addresses */
/** Peripheral LMEM base address */
#define LMEM_BASE                                IP_LMEM_BASE
/** Peripheral LMEM base pointer */
#define LMEM                                     IP_LMEM
/** Array initializer of LMEM peripheral base addresses */
#define LMEM_BASE_ADDRS                          IP_LMEM_BASE_ADDRS
/** Array initializer of LMEM peripheral base pointers */
#define LMEM_BASE_PTRS                           IP_LMEM_BASE_PTRS

/*!
 * @}
 */ /* end of group LMEM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- FTM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral_Access_Layer FTM Peripheral Access Layer
 * @{
 */

/* FTM - Peripheral instance base addresses */
/** Peripheral FTM0 base address */
#define FTM0_BASE                                IP_FTM0_BASE
/** Peripheral FTM0 base pointer */
#define FTM0                                     IP_FTM0
/** Peripheral FTM1 base address */
#define FTM1_BASE                                IP_FTM1_BASE
/** Peripheral FTM1 base pointer */
#define FTM1                                     IP_FTM1
/** Peripheral FTM2 base address */
#define FTM2_BASE                                IP_FTM2_BASE
/** Peripheral FTM2 base pointer */
#define FTM2                                     IP_FTM2
/** Peripheral FTM3 base address */
#define FTM3_BASE                                IP_FTM3_BASE
/** Peripheral FTM3 base pointer */
#define FTM3                                     IP_FTM3
/** Peripheral FTM4 base address */
#define FTM4_BASE                                IP_FTM4_BASE
/** Peripheral FTM4 base pointer */
#define FTM4                                     IP_FTM4
/** Peripheral FTM5 base address */
#define FTM5_BASE                                IP_FTM5_BASE
/** Peripheral FTM5 base pointer */
#define FTM5                                     IP_FTM5
/** Array initializer of FTM peripheral base addresses */
#define FTM_BASE_ADDRS                           IP_FTM_BASE_ADDRS
/** Array initializer of FTM peripheral base pointers */
#define FTM_BASE_PTRS                            IP_FTM_BASE_PTRS

/*!
 * @}
 */ /* end of group FTM_Peripheral_Access_Layer */

#endif /* _S32K146_DEVICE_H_ */
